

<?
/*
if($this->beginCache("content1",array("varyByParam"=>array("id")))):
*/

?>

<h3>Шахматы. Математика. Компьютеры</h3>

<div>В книге математика, шахматного мастера и писателя Евгения Гика исследуются различные связи между шахматами, математикой и компьютерами. Автор подводит итоги своих многолетних исследований по двум родственным темам — «Математика на шахматной доске» и «Компьютерные шахматы». Рассматриваются разные виды шахматно-математических задач и головоломок. Приводятся занимательные рекорды, анализируются геометрические свойства доски и фигур. Описываются необычные игры: сказочные, фишеровские, на цилиндрических досках и другие. Обсуждается математика турнирных расписаний и расчет рейтингов. Автор совершает экскурс в историю компьютерных шахмат, рассказывает о чемпионатах мира среди программ, о матчах машин с шахматными королями — Каспаровым и Крамником. Из этой шахматно-математической «Библии» читатель узнает также об успехах ЭВМ в анализе окончаний, решении задач, этюдов и головоломок.
    Содержание:
    Предисловие
    Математика на шахматной доске
    Глава 1. Математика на 64 клетках
    Глава 2. Конь-хамелеон
    Глава 3. Задача о ходе коня
    Глава 4. Ферзь-богатырь
    Глава 5. Задача о восьми ферзях
    Глава 6. Прямолинейная ладья
    Глава 7. Неторопливый король
    Глава 8. Стреноженный слон
    Глава 9. Независимость и доминирование
    Глава 10. Сила фигур
    Шахматно-математические игры
    Глава 11. Загадочные перестановки
    Глава 12. Математические рекорды
    Глава 13. На необычных досках
    Глава 14. Цилиндрические шахматы
    Глава 15. Гексагональные шахматы
    Глава 16. Сказочные шахматы
    Глава 17. Шахматы Фишера
    Глава 18. Логические игры и задачи
    Глава 19. Геометрия доски
    Глава 20. Симметрия и асимметрия
    Компьютерные шахматы
    Глава 21. Путешествие в прошлое
    Глава 22. Математика турниров
    Глава 23. Шахматы и латинские квадраты
    Глава 24. Рейтинг гроссмейстеров
    Глава 25. От Кемпелена до наших дней
    Глава 26. Эра новых чемпионов
    Глава 27. Человек уступает компьютеру
    Глава 28. Чемпионаты мира среди программ
    Глава 29. Машина анализирует эндшпиль
    Глава 30. Головоломки, задачи и этюды

    Автор: Евгений Гик
    Год: 2013
    Страниц: 336
    Формат: Djvu
    Качество: Хорошее
    Язык: Русский
    Скачать файл размером: 9.9 Mb</div>

<?
/*
$this->endCache();
endif;
*/
?>
